Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.GetFamilyInstanceId
Gets the Id of the fiting or accessory instance
Returns:
The element Id of the fiting or accessory instance.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.GetAllConnectorData
Gets the connector data of the pipe fitting or pipe accessory.
Remarks:
DuctFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient.
such as width, height, diameter and flow.
Returns:
All connector data.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.GetEntity
Returns an Entity of the Schema of the serverGUID.
or an invalid entity otherwise.
Remarks:
The Entity that is returned is a copy of the stored data (with copy-on-write optimization).
Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
Returns:
The Entity.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.AirViscosity
The air viscosity of the duct fitting or duct accessory, Units: (kg/(ft·s)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.Origin
The origin position of the duct fitting or duct accessory.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.SystemClassification
The system classification of the duct fitting or duct accessory.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.PartType
The part type of the duct fitting or duct accessory.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.ServerGUID
The GUID of the duct fitting or duct accessory.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Remarks:
A FamilyInstance is the input data for the calculation,
Since:
2014